Revit 2026 API

# FailuresAccessorGetFailureMessages Method

---

Provides access to the individual failure messages currently posted in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FailureMessageAccessor> GetFailureMessages()
```
```vb
Public Function GetFailureMessages As IList(Of FailureMessageAccessor)
```
```cpp
public:
IList<FailureMessageAccessor^>^ GetFailureMessages()
```
```fsharp
member GetFailureMessages : unit -> IList<FailureMessageAccessor>
```

#### Return Value

IListFailureMessageAccessor The accessors to the individual failure messages posted in the document.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

Returned set of messages will be ordered from more severe to less severe.

#### Reference

FailuresAccessor Class

GetFailureMessages Overload

Autodesk.Revit.DB Namespace